app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "comments" ("author", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "JUST INSERTED AN AUTHOR"], ["body", "HEY< I JUST PLACE A NEW AUTHOR"], ["post_id", 5], ["created_at", 2016-09-13 15:41:31 UTC], ["updated_at", 2016-09-13 15:41:31 UTC]]
---
	def create
		@post = Post.find(params[:post_id])
		#private var name posted
		#new instance of class Post
		#invoked method find
		#the params
		if @post.comments.create(comment_params)