app/controllers/occupants_controller.rb

  def index
    @occupants = Occupant.all
---
SELECT "occupants".* FROM "occupants"

  def create
    @occupant = Occupant.new(occupant_params)

    respond_to do |format|
      if @occupant.save
---
INSERT INTO "occupants" ("firstname", "lastname", "roomnumber", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["firstname", "Thao"], ["lastname", "Tran"], ["roomnumber", "1"], ["created_at", 2016-09-13 20:55:59 UTC], ["updated_at", 2016-09-13 20:55:59 UTC]]

def search
  @occupants = Occupant.search(params[:q])
---
SELECT "occupants".* FROM "occupants" WHERE (firstname LIKE '%Joe%' OR lastname LIKE '%Joe%')

  def destroy
    @occupant.destroy
---
DELETE FROM "occupants" WHERE "occupants"."id" = ?  [["id", 1]]

    def set_occupant
      @occupant = Occupant.find(params[:id])
---
SELECT  "occupants".* FROM "occupants" WHERE "occupants"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]