app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    if Post.all  != nil

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "fsdfs"], ["body", "sdfs"], ["created_at", 2016-09-13 01:43:05 UTC], ["updated_at", 2016-09-13 01:43:05 UTC]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save