app/controllers/roomapplies_controller.rb

  def index
    @roomapplies = Roomapply.all
---
SELECT "roomapplies".* FROM "roomapplies"

  def create
    @roomapply = Roomapply.new(roomapply_params)

    respond_to do |format|
      if @roomapply.save
---
INSERT INTO "roomapplies" ("fullname", "description", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["fullname", ""], ["description", ""], ["email", ""], ["created_at", 2016-09-13 21:06:25 UTC], ["updated_at", 2016-09-13 21:06:25 UTC]]

    def set_roomapply
      @roomapply = Roomapply.find(params[:id])
---
SELECT  "roomapplies".* FROM "roomapplies" WHERE "roomapplies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]